<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"66a828078123874b53a33cb812a6da702808baa3b4956753e5695c4701f0caeb","plan_job_ref":"Job Pull Request Checks #188 at https://github.com/GSA-TTS/FAC/actions/runs/17794753805","plan_out_hash":"20ccf523787682d3e2722b3e84650695717f2bb051c3aa7abb5103af442e996a","plan_hash":"7ad1eb84770aed288f982efda1dbf8b18a07c259d8314a80d2dc4f0d9e888b45","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 3 to add, 6 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "6afb597f-7278-4c73-b0d2-29d5b55911c4" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "6afb597f-7278-4c73-b0d2-29d5b55911c4" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "6afb597f-7278-4c73-b0d2-29d5b55911c4" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "3e9daee9-bafa-4da2-ad91-181f915042ab" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "3e9daee9-bafa-4da2-ad91-181f915042ab" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-09-11T10:46:16Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:93ca7fc01bfea357b2e835d285578012465ccb07b4f2ecc0975072e9d1717e94" -> "ghcr.io/gsa-tts/fac/clamav@sha256:2cfce0cacf289fc68dc51d2ed64f1c407136f8acca2923de50eec7cb46339d1a"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-09-11T10:46:23Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-09-11T10:45:40Z" -> (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-09-11T10:48:32Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:93ca7fc01bfea357b2e835d285578012465ccb07b4f2ecc0975072e9d1717e94" -> "ghcr.io/gsa-tts/fac/clamav@sha256:2cfce0cacf289fc68dc51d2ed64f1c407136f8acca2923de50eec7cb46339d1a"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging-fs.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-09-11T10:48:41Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.newrelic.newrelic_notification_destination.email_destination will be updated in-place
!~  resource "newrelic_notification_destination" "email_destination" {
        id         = "83e57a2d-ed53-4561-b575-7878efda69d2"
        name       = "email_destination"
#        (6 unchanged attributes hidden)

-       property {
-           key           = "email" -> null
-           value         = "matthew.jadud@gsa.gov, alexander.steel@gsa.gov" -> null
#            (2 unchanged attributes hidden)
        }
-       property {
-           key           = "source" -> null
-           label         = "terraform-source-internal" -> null
-           value         = "terraform" -> null
#            (1 unchanged attribute hidden)
        }
+       property {
+           key           = "email"
+           value         = "bret.mogilefsky@gsa.gov"
#            (2 unchanged attributes hidden)
        }
+       property {
+           key   = "source"
+           label = "terraform-source-internal"
+           value = "terraform"
        }
    }

  # module.staging.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "6afb597f-7278-4c73-b0d2-29d5b55911c4" -> null
-               app_process_type = "web" -> null
-               id               = "703d7452-2d2a-4044-9e01-fc23953bcaee" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8dec12f0-4f36-4b17-8f5d-f3adfbc29544"
!~      updated_at   = "2025-09-11T10:46:23Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "3e9daee9-bafa-4da2-ad91-181f915042ab" -> null
-               app_process_type = "web" -> null
-               id               = "31b25215-95c6-4876-87ef-a6bd2bb6ca15" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "99919341-e4d8-410f-8072-90dc1024b9cb"
!~      updated_at   = "2025-09-11T10:48:41Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 3 to add, 6 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #188](https://github.com/GSA-TTS/FAC/actions/runs/17794753805)